package com.semestr_8.ComputerSimulation;

/**
 * Задание 2: обеспечить определение на числовом отрезке [0,100] случайное положение точек – моментов изменения состояния одноканальной СМО с отказами,
 *  для которой известны характеристики: λ(t) – интенсивность потока заявок, μ(t) – интенсивность обслуживания.
 *  Должны подводиться итоги: количество обслуженных заявок, количество отказов. Варианты вида функции λ(t) заимствуются из задания 1.
 *  Варианты задания функции интенсивности обслуживания приведены в таблице. μ(t)={█(&0,2,если_ t∈[0,20┤[@&0,9,если_ t∈[20,80]@&0,4,если_ t∈├]80,100] )┤
 */
public class Task2 {
}
